//  Задача 19:Напишите программу,которая принимает на вход пятизначное число и проверяет,является ли оно палидромом.

// void Polydrome(int num){

//     if(num < 10000 || num >99999) Console.WriteLine("Некорректное число");

//     else{
//         if((num / 10000 == num % 10) && (num / 1000 % 10 == num % 100 / 10))
//             Console.WriteLine("Число является палиндромом");
//         else{
//             Console.WriteLine("Число не является палиндромом");
//         }
//     }
// }

// Console.Write(" Введите пятизначное число: ");
// int num = Convert.ToInt32(Console.ReadLine());

// Polydrome(num);


